status_msg = {
    200:'成功',
    10000:'用户名、密码、确认密码不能为空',
    10001:'用户名或密码错误',
    10002:'参数不完整',
    10003:'请登录',
    10004:"token无效或已过期",
    10011:'用户名长度需要在1-32字符之间',
    10012:'密码不能少于6位',
    10013:'密码不一致',
    10014:'手机号格式有误',
    10015:'邮箱格式有误',
    10016:'修改用户信息失败',
    10017:'删除失败,没有此用户',
    10018:'删除失败,没有此身份',
    10019:'数据不存在',
    10020:'没有上传文件',
    10021:'文件格式错误',
    10030:'该用户名已被注册,请更换',
    20000:'服务器内部错误',
    20001:'函数参数错误',
    20002:'修改操作异常',
    20003:'重置密码操作异常',
    20004:'获取用户身份异常',
    20005:'增加用户身份异常',
    20006:'更新用户身份信息失败'

}

def to_dict_msg(status=200,data=None,msg=None):
    return {
        'status':status,
        'data':data,
        # 如果msg有值,则使用msg,否则根据状态码获取msg
        'msg':msg if msg else status_msg.get(status)

    }
if __name__ == '__main__':
    print(to_dict_msg(10000))
